
well_irrigation_source = {
    "بئر عادي": 1,
    "بئر ارتوازي": 2,
    "بئر مشترك": 4,
    "مياه معالجة": 5,
    "شبكة ري عامة": 6,
    "صهريج ماء": 7,
    "أمطار": 10,
    "لا يوجد": 12,
}

well_irrigation_type = {
    "ري محوري": 1,
    "ري بالغمر": 2,
    "ري بالتنقيط": 3,
    "مطرية": 4,
    "لا يوجد": 6,
    "ري مدفعي": 7,
}

well_possession_type = {
    "مملوك": 1,
}
well_is_active = {
    "قائم": 1,
    "متوقف حالياً": 2,
    # "مهمل أو مهجور": 4,
    # "لم يتم رصده": 6,
}

property_main_type = {
    "زراعي غير عضوي": 1,
    "حيواني": 2,
    "مختلط": 3,
    "منشآت وخدمات مساندة": 4,
    "زراعي عضوي": 5,
}

farm_type = {
    "زراعة بالغمر": 1,
    "جهاز ري محوري": 2,
    "بيوت محمية": 5,
    "أشجار النخيل": 6,
    "أشجار دائمة": 7,
    "مشاتل": 10,
    "الزراعة المكشوفة": 11,
}

farm_main_crops_type = {
    "أعلاف": 1,
    "تمور": 2,
    "فواكه": 3,
    "خضروات": 4,
    "ورقيات": 5,
    "قمح": 6,
    "قمح بلدي": 7,
    "شعير": 8,
    "ذرة": 9,
    "زيتون": 10,
    "بن": 11,
    "مورينقا": 12,
    "منتجات عضوية": 13,
    "شتلات أو أشجار زينة": 14,
    "لا يوجد": 15,
}

farm_plantations_type = {
    "تباتات زينة": 1,
    "أشجار": 2,
    "خضروات": 3,
}

farm_house_type = {
    "بلاستيك عادي": 1,
    "بلاستيك مكيف": 2,
    "زجاج زراعة بالتربة": 3,
    "فايبر جلاس زراعة بالتربة": 4,
    "زجاج زراعة مائية": 6,
    "فايبر جلاس زراعة مائية": 7,
}

region = {
    "الرياض": 1,
    "مكة المكرمة": 2,
    "المدينة المنورة": 3,
    "القصيم": 4,
    "المنطقة الشرقية": 5,
    "عسير": 6,
    "تبوك": 7,
    "حائل": 8,
    "الحدود الشمالية": 9,
    "جازان": 10,
    "نجران": 11,
    "الباحة": 12,
    "الجوف": 13,
}

farm_farming_season = {
    "صيف": 1,
    "شتاء": 2,
    "طوال العام": 3,
    "لا يوجد": 4,
}

farm_activity_status = {
    "قائم": 1,
    "متوقف حالياً": 3,
    "مهمل أو مهجور": 4,
    "لم يتم رصده": 6,
}

farm_irrigation_source = {
    "بئر عادي": 1,
    "بئر ارتوازي": 2,
    "بئر مشترك": 4,
    "مياه معالجة": 5,
    "شبكة ري عامة": 6,
    "صهريج ماء": 7,
    "أمطار": 10,
    "لا يوجد": 12,
}

farm_irrigation_type = {
    "ري محوري": 1,
    "ري بالغمر": 2,
    "ري بالتنقيط": 3,
    "مطرية": 4,
    "لا يوجد": 6,
    "ري مدفعي": 7,
}
